<script setup lang="ts">
useHead({ title: '服务条款 - EasyAPI' })
</script>

<template>
  <div class="main">
    <div class="terms">
      <h2>服务条款</h2>
      <h3>一、服务条款的确认和接纳</h3>
      <p>
        EasyAPI（
        <a href="https://www.easyapi.com">https://www.easyapi.com</a>
        ）及其涉及到的产品、相关软件的所有权和运作权归帮趣团队（以下简称帮趣网络）所有，
        帮趣网络享有对EasyAPI上一切活动的监督、提示、检查、纠正及处罚等权利。用户通过注册EasyAPI服务平台系，即表示用户与帮趣网络已达成协议，自愿接受本服务条款的所有内容。如果用户不同意服务条款的条件，则不能获得使用www.easyapi.com服务以及注册成为EasyAPI用户的权利。
      </p>

      <h3>二、服务保护条款</h3>

      <p>1、 帮趣网络运用自己的操作系统通过国际互联网络为用户提供各项服务</p>

      <p>2、考虑到帮趣网络产品服务的重要性，用户同意:</p>
      （1）提供必要及准确的个人资料。
      <br>
      （2）不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。
      <br>
      3、用户可授权帮趣网络向第三方透露其注册资料，否则帮趣网络不能公开用户的姓名、住址、出件地址、电子邮箱、帐号。除非:
      <br>
      （1）事先获得用户明确授权后，用户要求帮趣网络或授权某人通过电子邮件服务或其他方式透露这些信息。
      <br>
      （2）相应的法律、法规要求以及按照有关政府主管部门的要求，需要帮趣网络提供用户的个人资料。
      <br>
      （3）为了维护公众以及EasyAPI合法利益。
      <br>
      4、如果用户提供的资料不准确，不合法有效，帮趣网络保留结束用户使用帮趣网络各项服务的权利。
      <br>
      用户在享用帮趣网络各项服务的同时，同意接受帮趣网络提供的各类信息服务。
      <br>
      5、帮趣网络定义的信息内容包括:文字、软件、声音、照片、录像、图表；在广告中全部内容；帮趣网络为用户提供的商业信息等，所有这些内容受版权、商标权、和其它知识产权及所有权法律的保护。所以，用户只能在帮趣网络授权下才能使用这些内容，而不能擅自复制、修改、编撰这些内容、或创造与内容有关的衍生产品。
      <br>
      6、如果用户未遵守本服务条款的任何一项，帮趣网络有权利即终止提供一切服务，并保留通过法律手段追究责任的权利。
      <br>
      7、使用EasyAPI提供的服务由用户自己承担风险，在适用法律允许的最大范围内，帮趣网络在任何情况下不就因使用或不能使用EasyAPI提供的服务所发生的特殊的、意外的、直接或间接的损失承担赔偿责任。即使已事先被告知该损害发生的可能性。
      <br>
      8、用户须明白，使用EasyAPI提供的服务涉及到Internet服务和电信增值服务，可能会受到各个环节不稳定因素的影响。因此服务存在因不可抗力、计算机病毒或黑客攻击、国家相关行业主管部门及电信运营商的调整、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。用户须承担以上风险，帮趣网络不作担保。对因此导致用户不能发送、上传和接受阅读消息、或接发错消息，或无法实现其他通讯条件，帮趣网络不承担任何责任。
      <br>
      9、用户须明白，在使用EasyAPI提供的服务存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，帮趣网络和合作公司对服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适用性、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。
      <br>

      <h3>三、用户使用规则</h3>
      特别提示用户，使用互联网必须遵守国家有关的政策和法律，包括刑法、国家安全法、保密法、计算机信息系统安全保护条例等，保护国家利益，保护国家安全，对于违法使用互联网络而引起的一切责任，由用户负全部责任。
      <br>
      1、用户在申请使用EasyAPI提供的网络服务时，必须向帮趣网络提供准确的个人资料，如个人资料有任何变动，必须及时更新。
      <br>
      2、用户注册成功后，帮趣网络将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
      <br>
      3、用户不得使用EasyAPI服务发送或传播敏感信息和违反国家法律制度的信息，包括但不限于下列信息:
      <br>
      (a) 反对宪法所确定的基本原则的；
      <br>
      (b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
      <br>
      (c) 损害国家荣誉和利益的；
      <br>
      (d) 煽动民族仇恨、民族歧视，破坏民族团结的；
      <br>
      (e) 破坏国家宗教政策，宣扬邪教和封建迷信的；
      <br>
      (f) 散布谣言，扰乱社会秩序，破坏社会稳定的；
      <br>
      (g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
      <br>
      (h) 侮辱或者诽谤他人，侵害他人合法权益的；
      <br>
      (i) 含有法律、行政法规禁止的其他内容的。
      <br>
      4、用户在使用EasyAPI服务过程中，必须遵循以下原则:
      <br>
      (a) 遵守中国有关的法律和法规；
      <br>
      (b) 不得为任何非法目的而使用网络服务系统；
      <br>
      (c) 遵守所有与网络服务有关的网络协议、规定和程序；
      <br>
      (d) 不得利用EasyAPI服务进行任何可能对互联网的正常运转造成不利影响的行为；
      <br>
      (e) 不得利用EasyAPI服务传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
      <br>
      (f) 不得利用EasyAPI服务进行任何不利于帮趣网络的行为。
      <br>
      5、使用EasyAPI服务，用户应加强个人资料的保护意识，并注意个人密码的密码保护。
      <br>
      6、盗取他人用户帐号或利用网络通讯骚扰他人，均属于非法行为。用户不得采用测试、欺骗等任何非法手段，盗取其他用户的帐号和对他人进行骚扰。
      <br>

      <h3>四、服务条款修订</h3>
      此条款在必要时将进行修订，且毋须另行通知。修订后的条款一旦在网页上公布即有效代替原来的服务条款。

      <h3>五、用户隐私制度</h3>
      尊重用户个人隐私是帮趣网络的一项基本政策。所以，作为对以上第二点个人注册资料分析的补充，帮趣网络一定不会公开、编辑或透露用户的注册资料及保存在帮趣网络各项服务中的非公开内容，除非帮趣网络在诚信的基础上认为透露这些信息在以下几种情况是必要的:
      <br>
      （1）遵守有关法律规定，包括在国家有关机关查询时，提供用户在EasyAPI的平台上发布的信息内容及其发布时间、互联网地址或者域名以及其他用户上传至EasyAPI的信息。
      <br>
      （2）遵从EasyAPI产品服务程序。
      <br>
      （3）保持维护帮趣网络的商标所有权。
      <br>
      （4）在紧急情况下维护用户个人和社会大众的隐私安全。
      <br>
      （5）帮趣网络认为必要的其他情况下。
      <br>
      用户在此授权帮趣网络可以向其电子邮箱发送商业信息。
      <br>

      <h3>六、用户的帐号、密码和安全性</h3>
      用户一旦成功注册，将得到一个密码和帐号。如果用户未保管好自己的帐号和密码而对其自身、帮趣网络或第三方造成的损害，用户将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。用户可随时改变自己的密码和图标。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告帮趣网络。
      <br>

      <h3>七、拒绝提供担保</h3>
      用户明确同意邮件服务的使用由用户个人承担风险。帮趣网络不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性、出错发生都不作担保。帮趣网络拒绝提供任何担保，包括信息能否准确、及时、顺利地传送。
      <br>

      <h3>八、有限责任</h3>
      帮趣网络对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用产品服务，在网上购买商品或类似服务，在网上进行交易，非法使用服务或用户传送的信息有所变动。用户的上述行为引起对帮趣网络或第三方的损害，应当依法承担责任并向帮趣网络进行赔偿，帮趣网络可以自行或协助第三方使用用户提供的任何信息进行维权。
      <br>

      <h3>九、未经帮趣网络同意禁止进行商业性行为</h3>
      用户承诺不经帮趣网络书面同意，不能利用帮趣网络各项服务在EasyAPI或相关网站上进行销售或其他商业性行为。用户违反此约定，帮趣网络将依法追究其违约责任，由此给帮趣网络造成损失的，帮趣网络有权进行追偿。
      <br>

      <h3>十、EasyAPI用户信息的储存及限制</h3>
      帮趣网络不对用户所发布信息的删除或储存失败负责。
      <br>

      <h3>十一、保障</h3>
      用户同意保障和维护帮趣网络全体成员的利益。
      <br>

      <h3>十二、结束服务</h3>
      用户或帮趣网络可随时根据实际情况中断服务。帮趣网络不需对任何个人或第三方负责而随时中断服务。用户若反对任何服务条款的建议或对后来的条款修改有异议，或对帮趣网络服务不满，用户享有以下的追索权:
      <br>
      （1）不再使用帮趣网络及（或）EasyAPI的服务。
      <br>
      （2）结束用户使用帮趣网络及（或）EasyAPI服务的资格。
      <br>
      （3）书面通告帮趣网络停止该用户的服务。
      <br>
      结束用户服务后，用户使用帮趣网络服务的权利马上中止。从那时起，帮趣网络不再对用户承担任何义务。
      <br>

      <h3>十三、通告</h3>
      所有发给用户的通告都可通过电子邮件或常规的信件传送。帮趣网络会通过邮件服务发报消息给用户，告诉他们服务条款的修改、服务变更、或其它重要事情。同时，帮趣网络保留对EasyAPI用户投放商业性广告的权利。
      <br>

      <h3>十四、参与广告策划</h3>
      在帮趣网络书面许可下用户可在他们发表的信息中加入宣传资料或参与广告策划，在EasyAPI各项免费服务上展示他们的产品，是在相应的用户和广告销售商之间发生。
      帮趣网络不承担任何责任，帮趣网络没有义务为这类广告销售负任何责任。&nbsp;
      <br>

      <h3>十五、免责与赔偿声明</h3>
      1、若帮趣网络已经明示其网络服务提供方式发生变更并提醒用户应当注意事项，用户未按要求操作所产生的一切后果由用户自行承担。
      <br>
      2、用户明确同意其使用帮趣网络网络服务所存在的风险将完全由其自己承担；因其使用帮趣网络服务而产生的一切后果也由其自己承担，帮趣网络对用户不承担任何责任。
      <br>
      3、帮趣网络不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
      <br>
      4、用户同意保障和维护帮趣网络及其他用户的利益，由于用户登录网站内容违法、不真实、不正当、侵犯第三方合法权益，或用户违反本协议项下的任何条款而给帮趣网络或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
      <br>

      <h3>十六、法律</h3>
      用户和帮趣网络一致同意有关本协议以及使用帮趣网络的服务产生的争议交由仲裁解决，但是帮趣网络有权选择采取诉讼方式，并有权选择受理该诉讼的有管辖权的法院。若有任何服务条款与法律相抵触，那这些条款将按尽可能接近的方法重新解析，而其它条款则保持对用户产生法律效力和影响。
      <br>

      <h3>十七、其他</h3>
      1、帮趣网络将视向用户所提供服务内容之特性，要求用户在注册公司提供的有关服务时，遵守特定的条件和条款；如该特定条件和条款与以上服务条款有任何不一致之处，则已特定条件和条款为准。
      <br>
      2、本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，其余条款仍应有效并且有约束力。
      <br>
      3、本服务条款执行过程中所产生的任何问题EasyAPI和用户都将友好协商解决。
      <br>
      4、以上条款的解释权归帮趣网络最终所有。
      <br>
    </div>
  </div>
</template>

<style lang="scss">
@import url(./index.scss);
</style>
